/*
*********************************************************************************************************
*
*	模块名称 : OPT3001驱动模块
*	文件名称 : bsp_opt3001.c
*	版    本 : V1.0
*	说    明 : 
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2024-06-05 	Lawrence  正式发布
*
*	Copyright (C), 2014-2024, 德致伦电子
*
*********************************************************************************************************
*/

///////////////////////////////////////
/* 头文件包含区 */
#include "bsp.h"

///////////////////////////////////////
/* 变量定义区 */

///////////////////////////////////////
/* 外部变量申明区 */

///////////////////////////////////////
/* 函数申明区 */

///////////////////////////////////////
/* 函数实体区 */
/*
*********************************************************************************************************
*	函 数 名: Opt3001WriteRegister
*	功能说明: OPT3001寄存器写函数
*	形    参：uint8_t  registerName:寄存器地址
				uint16_t value:需要往寄存器里面写数据
*	返 回 值: 无
*********************************************************************************************************
*/
void Opt3001WriteRegister(uint8_t registerName,uint16_t value)
{
	IIC_Start();					//起始信号
	IIC_Send_Byte(OPT3001_ADDR);	//发送设备地址+写信号
	IIC_Wait_Ack();
	IIC_Send_Byte(registerName);	//发送存储单元地址
	IIC_Wait_Ack();
	IIC_Send_Byte((uint8_t)(value >> 8));
	IIC_Wait_Ack();
	IIC_Send_Byte((uint8_t)(value & 0x00ff));
	IIC_Wait_Ack();
	IIC_Stop();						//停止信号
}
/*
*********************************************************************************************************
*	函 数 名: OPT3001Multiple_read
*	功能说明: 读取OPT3001内部数据，连续两个字节
*	形    参：ST_Address 存储单元地址
*	返 回 值: 读取的数据
*********************************************************************************************************
*/
uint16_t OPT3001Multiple_read(uint8_t ST_Address)
{
	uint8_t msb=0,lsb=0;			//高位和低位
	uint16_t _data;					//数据
	
	IIC_Start();					//起始信号
	IIC_Send_Byte(OPT3001_ADDR);	//发送设备地址+写信号
	IIC_Wait_Ack();
	IIC_Send_Byte(ST_Address);		//发送存储单元地址
	IIC_Wait_Ack();
	IIC_Stop();
	
	IIC_Start();					//起始信号
	IIC_Send_Byte(OPT3001_ADDR|0x01);			//发送设备地址+读信号
	IIC_Wait_Ack();
	msb = IIC_Read_Byte(0x01);		//BUF[0]存储 发送ACK
	lsb = IIC_Read_Byte(0x00);		//发送NACK
	IIC_Stop();						//停止信号
	delay_ms(5);
	_data = msb << 8;
	_data |= lsb;
	return _data;
}
/*
*********************************************************************************************************
*	函 数 名: GetOPT3001ManufacturerId
*	功能说明: 获取OPT3001的出厂编号
*	形    参：无
*	返 回 值: 返回OPT3001出厂编号，默认值为0x5499
*********************************************************************************************************
*/
uint16_t GetOPT3001ManufacturerID(void)
{
	uint16_t IDNum = 0;
	IDNum = OPT3001Multiple_read(OPT3001_MANUFACTURER_ID);//读取
	//printf("读取的GetOPT3001ManufacturerID为 %X\r\n",IDNum);
	return IDNum;
}
/*
*********************************************************************************************************
*	函 数 名: GetOPT3001DevicID
*	功能说明: 获取OPT3001的设备ID
*	形    参：无
*	返 回 值: OPT3001的设备ID，初始值为0x3001
*********************************************************************************************************
*/
uint16_t GetOPT3001DeviceID(void)
{
	uint16_t IDNum = 0;
	IDNum = OPT3001Multiple_read(OPT3001_DEVICE_ID);//读取
	//printf("读取的GetOPT3001DevicIDm为 %X\r\n",IDNum);
	return IDNum;
}
/*
*********************************************************************************************************
*	函 数 名: 
*	功能说明: 
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
uint8_t bsp_InitOpt3001(void)
{
	uint16_t ManufacturerIDNum = 0;
	uint16_t DeviceIDNum = 0;
	
	bsp_InitI2C();				//OPT3001端口初始化
	OPT3001Config();			//配置OPT3001并唤醒OPT3001
	delay_ms(5);
	ManufacturerIDNum = GetOPT3001ManufacturerID();//读取
	printf("ManufacturerIDNum is %X\r\n",ManufacturerIDNum);//调试
	delay_us(100);
	
	DeviceIDNum= GetOPT3001DeviceID();
	printf("DeviceIDNum is %X\r\n",DeviceIDNum);
	if((ManufacturerIDNum == OPT3001_ManufacturerID) && (DeviceIDNum == OPT3001_DeviceID))//如果读出来OD都正确表示初始化成功
	{
		printf("初始化成功\r\n");
		return 0;
		
	}
	else //否则初始化不成功

		return 1;
	
	
}
/*
*********************************************************************************************************
*	函 数 名: OPT3001Config
*	功能说明: OPT3001寄存器配置
*	形    参：无
*	返 回 值: 
				12-15位 RN[0,3]:0x1100,设置为Full-Scale Mode
				9-10:M[0,1]:0x10,设置OPT3001为连续转模式
				4bit:Latch = 1,其他位初始化为00即可
*********************************************************************************************************
*/
void OPT3001Config(void)
{
		Opt3001WriteRegister(OPT3001_CONFIGURATION,0xC410);
}
/*
*********************************************************************************************************
*	函 数 名: GetLuxValue
*	功能说明: 获取光强度
*	形    参：无
*	返 回 值: 得到的是放大100倍后的值 占4个字节
*********************************************************************************************************
*/
uint32_t GetLuxValue(void)
{
	uint32_t Result = 0;
	
	Result = OPT3001Multiple_read(OPT3001_RESULT);		//读取
	Result = (1<<((Result & 0xF000)>>12))*(Result & 0x0FFF);//得到计算的值是真实值的100倍
	return Result;
}
///////////////////////////////////////

/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
