/*
*********************************************************************************************************
*
*	模块名称 : UART4模块
*	文件名称 : bsp_uart4.h
*	说    明 : 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2024-6-03     SDZ
*
*	Copyright (C), 2014-2024, 德致伦电子
*
*********************************************************************************************************
*/

#ifndef _BSP_UART4_H_
#define _BSP_UART4_H_

///////////////////////////////////////
/* 头文件包含区 */
#include "bsp.h"
///////////////////////////////////////
/* 宏定义区域 */
#define UART4_BUF_LEN     64    //定义UART4缓冲区长度为64个字节
#define EN_UART4_RX      1       //使能（1）/禁止（0）串口1接收
///////////////////////////////////////
/* 外部变量申明区 */
extern uint8_t UART4_RX_BUF[UART4_BUF_LEN];    //接收缓存，最大UART4_BUF_LEN个字节
extern uint8_t UART4_RX_CNT;					//接受到的数据长度
///////////////////////////////////////
/* 函数申明区 */
void bsp_InitUart4(uint32_t baud);
void UART4_Send_Data(uint8_t *buf,uint8_t len);
void UART4_Receive_Data(uint8_t *buf,uint8_t *len);
void Uart4_STA_Clr(void);
///////////////////////////////////////
#endif

