/*
*********************************************************************************************************
*
*	模块名称 : 模块
*	文件名称 : bsp_uart4.h
*	说    明 : 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2024-3-20
*
*	Copyright (C), 2014-2024, 德致伦电子
*
*********************************************************************************************************
*/

#ifndef _BSP_UART5_H_
#define _BSP_UART5_H_

///////////////////////////////////////
/* 头文件包含区 */
#include "bsp.h"
#include "sys.h"
///////////////////////////////////////
/* 宏定义区域 */
#define UART5_BUF_LEN 	64			//定义UART4缓冲长度为64个字节
#define EN_UART5_RX 	1			//UART4使能接收,0为不接收，1为接收
///////////////////////////////////////
/* 外部变量申明区 */
extern uint8_t UART5_RX_BUF[UART5_BUF_LEN];	//UART4的缓存数组
extern uint8_t UART5_RX_CNT;					//接收到的数据长度
///////////////////////////////////////
/* 函数申明区 */
void bsp_InitUart5(uint32_t bound);
void UART5_Send_Data(uint8_t *buf,uint8_t len);
void UART5_Receive_Data(uint8_t *buf,uint8_t *len);
void Uart5_STA_Clr(void);
#endif


/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
