/*
*********************************************************************************************************
*
*	模块名称 : IIC驱动模块
*	文件名称 : bsp_iic.c
*	版    本 : V1.0
*	说    明 : 
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2024-05-31 付燕华  正式发布
*
*	Copyright (C), 2014-2024, 德致伦电子
*
*********************************************************************************************************
*/

///////////////////////////////////////
/* 头文件包含区 */
#include	"bsp.h"
///////////////////////////////////////
/* 变量定义区 */

///////////////////////////////////////
/* 外部变量申明区 */

///////////////////////////////////////
/* 函数申明区 */

///////////////////////////////////////
/* 函数实体区 */
/*
*********************************************************************************************************
*	函 数 名: bsp_InitI2C
*	功能说明: 配置IIC相关的GPIO。
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitI2C(void) 
{           
	GPIO_InitTypeDef GPIO_InitStructure; 
  
	RCC_APB2PeriphClockCmd( SCL_GPIO_CLK, ENABLE );  //使能SCL时钟 
	RCC_APB2PeriphClockCmd( SDA_GPIO_CLK, ENABLE );  //使能SDA时钟 
  
  
	GPIO_InitStructure.GPIO_Pin = SCL_GPIO_PIN; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP ;   //推挽输出 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(SCL_GPIO_PORT, &GPIO_InitStructure); 
	GPIO_SetBits(SCL_GPIO_PORT,SCL_GPIO_PIN);    //SCL 输出高 
  
  
	GPIO_InitStructure.GPIO_Pin = SDA_GPIO_PIN; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP ;   //推挽输出 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(SDA_GPIO_PORT, &GPIO_InitStructure); 
	GPIO_SetBits(SDA_GPIO_PORT,SDA_GPIO_PIN);    //SDA 输出高 
  
  
} 

/*
*********************************************************************************************************
*	函 数 名: IIC_Start
*	功能说明: 产生IIC起始信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_Start(void)
{
	SDA_OUT();		//sda线输出
	IIC_SDA=1;
	IIC_SCL=1; 
	delay_us(4); 
	IIC_SDA=0;//START:when CLK is high,DATA change form high to low  
	delay_us(4); 
	IIC_SCL=0;//钳住I2C总线，准备发送或接收数据  
}

/*
*********************************************************************************************************
*	函 数 名: IIC_Stop
*	功能说明: 产生IIC结束信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_Stop(void) 
{ 
	SDA_OUT();//sda线输出 
	IIC_SCL=0; 
	IIC_SDA=0;//STOP:when CLK is high DATA change form low to high 
	delay_us(4); 
	IIC_SCL=1;  
	IIC_SDA=1;//发送I2C总线结束信号 
	delay_us(4);            
}

/*
*********************************************************************************************************
*	函 数 名: IIC_Wait_Ack 
*	功能说明: 等待应答信号到来。
*	形    参：无
*	返 回 值: 1，接收应答失败 ,0接收应答成功
*********************************************************************************************************
*/
uint8_t	IIC_Wait_Ack(void)
{
	uint8_t	ucErrTime=0;
	SDA_IN();			//SDA设置输入
	IIC_SDA=1;delay_us(1);     
	IIC_SCL=1;delay_us(1);   
	while(READ_SDA) 
	{ 
		ucErrTime++; 
	if(ucErrTime>250) 
	{ 
		IIC_Stop(); 
		return 1; 
	} 
	} 
	IIC_SCL=0;//时钟输出0      
	return 0;   
}
/*
*********************************************************************************************************
*	函 数 名: IIC_Ack
*	功能说明: 产生ACK应答。 
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void	IIC_Ack(void)
{
	IIC_SCL=0;
	SDA_OUT();
	IIC_SDA=0;
	delay_us(2);
	IIC_SCL=1;
	delay_us(2);
	IIC_SCL=0;
}
/*
*********************************************************************************************************
*	函 数 名: IIC_NAck
*	功能说明: 不产生ACK应答。
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_NAck(void) 
{ 
	IIC_SCL=0; 
	SDA_OUT(); 
	IIC_SDA=1; 
	delay_us(2); 
	IIC_SCL=1; 
	delay_us(2); 
	IIC_SCL=0; 
}
/*
*********************************************************************************************************
*	函 数 名:  IIC_Send_Byte 
*	功能说明: IIC发送一个字节。
*	形    参：返回从机有无应答1，有应答 
*   							 0，无应答 
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_Send_Byte(uint8_t txd) 
{                         
	uint8_t t;    
	SDA_OUT();       
    IIC_SCL=0;//拉低时钟开始数据传输 
    for(t=0;t<8;t++) 
    {               
        //IIC_SDA=(txd&0x80)>>7; 
	if((txd&0x80)>>7) 
	IIC_SDA=1; 
	else 
	IIC_SDA=0; 
	txd<<=1;     
	delay_us(2);   //对TEA5767这三个延时都是必须的 
	IIC_SCL=1; 
	delay_us(2);  
	IIC_SCL=0;  
	delay_us(2); 
    }   
}    
/*
*********************************************************************************************************
*	函 数 名: IIC_Read_Byte 
*	功能说明:  读1个字节，ack=1时，发送ACK，ack=0，发送nACK。
*	形    参：返回从机有无应答 
*    		1，发送ACK 
*   		 0，发送nACK 
*	返 回 值: 返回读取到的1字节数据  
*********************************************************************************************************
*/
u8 IIC_Read_Byte(uint8_t ack) 
{ 
 uint8_t i,receive=0; 
 SDA_IN();//SDA设置为输入 
    for(i=0;i<8;i++ ) 
	{ 
        IIC_SCL=0;  
        delay_us(2); 
		IIC_SCL=1; 
		receive<<=1; 
		if(READ_SDA)receive++;    
		delay_us(1);  
	}       
	if (!ack) 
		IIC_NAck();//发送 nACK 
	else 
		IIC_Ack(); //发送 ACK    
	return receive; 
} 


///////////////////////////////////////

/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
